; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		a c t i o n u f r e s - block
	)
	(:init
		(handempty)
		(clear c)
		(on c i)
		(on i o)
		(on o n)
		(ontable n)
		(clear r)
		(on r s)
		(on s u)
		(ontable u)
		(clear t)
		(on t e)
		(on e a)
		(on a f)
		(ontable f)
	)
	(:goal (and
		;; reaction
		(clear r) (ontable n) (on r e) (on e a) (on a c) (on c t) (on t i) (on i o) (on o n)
	))
)

; plan
1. (unstack c i)
   deleted: (clear c) (handempty) (on c i)
   added: (holding c) (clear i)
   goals met: 5 of 9
2. (stack c r)
   deleted: (holding c) (clear r)
   added: (clear c) (handempty) (on c r)
   goals met: 4 of 9
3. (unstack t e)
   deleted: (clear t) (handempty) (on t e)
   added: (holding t) (clear e)
   goals met: 4 of 9
4. (stack t i)
   deleted: (holding t) (clear i)
   added: (clear t) (handempty) (on t i)
   goals met: 5 of 9
5. (unstack c r)
   deleted: (clear c) (handempty) (on c r)
   added: (holding c) (clear r)
   goals met: 6 of 9
6. (stack c t)
   deleted: (holding c) (clear t)
   added: (clear c) (handempty) (on c t)
   goals met: 7 of 9
7. (unstack e a)
   deleted: (clear e) (handempty) (on e a)
   added: (holding e) (clear a)
   goals met: 6 of 9
8. (stack e r)
   deleted: (holding e) (clear r)
   added: (clear e) (handempty) (on e r)
   goals met: 5 of 9
9. (unstack a f)
   deleted: (clear a) (handempty) (on a f)
   added: (holding a) (clear f)
   goals met: 5 of 9
10. (stack a c)
   deleted: (holding a) (clear c)
   added: (clear a) (handempty) (on a c)
   goals met: 6 of 9
11. (unstack e r)
   deleted: (clear e) (handempty) (on e r)
   added: (holding e) (clear r)
   goals met: 7 of 9
12. (stack e a)
   deleted: (holding e) (clear a)
   added: (clear e) (handempty) (on e a)
   goals met: 8 of 9
13. (unstack r s)
   deleted: (clear r) (handempty) (on r s)
   added: (holding r) (clear s)
   goals met: 7 of 9
14. (stack r e)
   deleted: (holding r) (clear e)
   added: (clear r) (handempty) (on r e)
   goals met: 9 of 9
